wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_rcu.h
/*!
    \file    gd32g5x3_rcu.h
    \brief   definitions for the RCU

    \version 2026-02-04, V1.5.0, firmware for GD32G5x3
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef GD32G5X3_RCU_H
#define GD32G5X3_RCU_H

#include "gd32g5x3.h"

/* RCU definitions */
#define RCU                             RCU_BASE

/* registers definitions */
#define RCU_CTL                         REG32(RCU + 0x00000000U)        /*!< control register */
#define RCU_PLL                         REG32(RCU + 0x00000004U)        /*!< PLL register */
#define RCU_CFG0                        REG32(RCU + 0x00000008U)        /*!< clock configuration register 0 */
#define RCU_INT                         REG32(RCU + 0x0000000CU)        /*!< clock interrupt register */
#define RCU_AHB1RST                     REG32(RCU + 0x00000010U)        /*!< AHB1 reset register */
#define RCU_AHB2RST                     REG32(RCU + 0x00000014U)        /*!< AHB2 reset register */
#define RCU_AHB3RST                     REG32(RCU + 0x00000018U)        /*!< AHB3 reset register */
#define RCU_APB1RST                     REG32(RCU + 0x00000020U)        /*!< APB1 reset register */
#define RCU_APB2RST                     REG32(RCU + 0x00000024U)        /*!< APB2 reset register */
#define RCU_APB3RST                     REG32(RCU + 0x00000028U)        /*!< APB3 reset register */
#define RCU_AHB1EN                      REG32(RCU + 0x00000030U)        /*!< AHB1 enable register */
#define RCU_AHB2EN                      REG32(RCU + 0x00000034U)        /*!< AHB2 enable register */
#define RCU_AHB3EN                      REG32(RCU + 0x00000038U)        /*!< AHB3 enable register */
#define RCU_APB1EN                      REG32(RCU + 0x00000040U)        /*!< APB1 enable register */
#define RCU_APB2EN                      REG32(RCU + 0x00000044U)        /*!< APB2 enable register */
#define RCU_APB3EN                      REG32(RCU + 0x00000048U)        /*!< APB3 enable register */
#define RCU_AHB1SPDPEN                  REG32(RCU + 0x00000050U)        /*!< AHB1 sleep and deep-sleep mode enable register */
#define RCU_AHB2SPDPEN                  REG32(RCU + 0x00000054U)        /*!< AHB2 sleep and deep-sleep mode enable register */
#define RCU_AHB3SPDPEN                  REG32(RCU + 0x00000058U)        /*!< AHB3 sleep and deep-sleep mode enable register */ 
#define RCU_APB1SPDPEN                  REG32(RCU + 0x00000060U)        /*!< APB1 sleep and deep-sleep mode enable register */
#define RCU_APB2SPDPEN                  REG32(RCU + 0x00000064U)        /*!< APB2 sleep and deep-sleep mode enable register */
#define RCU_APB3SPDPEN                  REG32(RCU + 0x00000068U)        /*!< APB3 sleep and deep-sleep mode enable register */
#define RCU_BDCTL                       REG32(RCU + 0x00000070U)        /*!< backup domain control register */
#define RCU_RSTSCK                      REG32(RCU + 0x00000074U)        /*!< reset source / clock register */
#define RCU_CFG1                        REG32(RCU + 0x0000008CU)        /*!< clock configuration register 1 */
#define RCU_CFG2                        REG32(RCU + 0x00000090U)        /*!< clock configuration register 2 */

/* bits definitions */
/* RCU_CTL */
#define RCU_CTL_IRC8MEN                 BIT(0)                    /*!< internal high speed oscillator enable */
#define RCU_CTL_IRC8MSTB                BIT(1)                    /*!< IRC8M high speed internal oscillator stabilization flag */
#define RCU_CTL_IRC8MADJ                BITS(3,7)                 /*!< high speed internal oscillator clock trim adjust value */
#define RCU_CTL_IRC8MCALIB              BITS(8,15)                /*!< high speed internal oscillator calibration value register */
#define RCU_CTL_HXTALEN                 BIT(16)                   /*!< external high speed oscillator enable */
#define RCU_CTL_HXTALSTB                BIT(17)                   /*!< external crystal oscillator clock stabilization flag */
#define RCU_CTL_HXTALBPS                BIT(18)                   /*!< external crystal oscillator clock bypass mode enable */
#define RCU_CTL_CKMEN                   BIT(19)                   /*!< HXTAL clock monitor enable */   
#define RCU_CTL_HXTALSTBRST             BIT(20)                   /*!< HXTAL stabilization reset */
#define RCU_CTL_PLLEN                   BIT(24)                   /*!< PLL enable */
#define RCU_CTL_PLLSTB                  BIT(25)                   /*!< PLL clock stabilization flag */

/* RCU_PLL */
#define RCU_PLL_PLLPSC                  BITS(0,3)                 /*!< The PLL VCO source clock prescaler */
#define RCU_PLL_PLLN                    BITS(6,13)                /*!< The PLL VCO clock multi factor */
#define RCU_PLL_PLLP                    BITS(16,17)               /*!< The PLLP output frequency division factor from PLL VCO clock */
#define RCU_PLL_PLLPEN                  BIT(19)                   /*!< PLL DIVP divider output enable */
#define RCU_PLL_PLLQEN                  BIT(20)                   /*!< PLL DIVQ divider output enable */
#define RCU_PLL_PLLREN                  BIT(21)                   /*!< PLL DIVR divider output enable */
#define RCU_PLL_PLLSEL                  BIT(22)                   /*!< PLL clock source selection */
#define RCU_PLL_PLLQ                    BITS(23,26)               /*!< The PLL Q output frequency division factor from PLL VCO clock */
#define RCU_PLL_PLLR                    BITS(27,31)               /*!< The PLL R output frequency division factor from PLL VCO clock */

/* RCU_CFG0 */
#define RCU_CFG0_SCS                    BITS(0,1)                 /*!< system clock switch */
#define RCU_CFG0_SCSS                   BITS(2,3)                 /*!< system clock switch status */
#define RCU_CFG0_AHBPSC                 BITS(4,7)                 /*!< AHB prescaler selection */
#define RCU_CFG0_APB1PSC                BITS(10,12)               /*!< APB1 prescaler selection */
#define RCU_CFG0_APB2PSC                BITS(13,15)               /*!< APB2 prescaler selection */
#define RCU_CFG0_CKOUTSEL               BITS(21,23)               /*!< CKOUT clock source selection */
#define RCU_CFG0_CKOUTDIV               BITS(24,26)               /*!< The CK_OUT divider which the CK_OUT frequency can be reduced */
#define RCU_CFG0_APB3PSC                BITS(27,29)               /*!< APB3 prescaler selection */

/* RCU_INT */
#define RCU_INT_IRC32KSTBIF             BIT(0)                    /*!< IRC32K stabilization interrupt flag */
#define RCU_INT_LXTALSTBIF              BIT(1)                    /*!< LXTAL stabilization interrupt flag */
#define RCU_INT_IRC8MSTBIF              BIT(2)                    /*!< IRC8M stabilization interrupt flag */
#define RCU_INT_HXTALSTBIF              BIT(3)                    /*!< HXTAL stabilization interrupt flag */
#define RCU_INT_PLLSTBIF                BIT(4)                    /*!< PLL stabilization interrupt flag */
#define RCU_INT_CKMIF                   BIT(7)                    /*!< HXTAL clock stuck interrupt flag */
#define RCU_INT_IRC32KSTBIE             BIT(8)                    /*!< IRC32K stabilization interrupt enable */
#define RCU_INT_LXTALSTBIE              BIT(9)                    /*!< LXTAL stabilization interrupt enable */
#define RCU_INT_IRC8MSTBIE              BIT(10)                   /*!< IRC8M stabilization interrupt enable */
#define RCU_INT_HXTALSTBIE              BIT(11)                   /*!< HXTAL stabilization interrupt enable */
#define RCU_INT_PLLSTBIE                BIT(12)                   /*!< PLL stabilization interrupt enable */
#define RCU_INT_IRC32KSTBIC             BIT(16)                   /*!< IRC32K stabilization interrupt clear */
#define RCU_INT_LXTALSTBIC              BIT(17)                   /*!< LXTAL stabilization interrupt clear */
#define RCU_INT_IRC8MSTBIC              BIT(18)                   /*!< IRC8M stabilization interrupt clear */
#define RCU_INT_HXTALSTBIC              BIT(19)                   /*!< HXTAL stabilization interrupt clear */
#define RCU_INT_PLLSTBIC                BIT(20)                   /*!< PLL stabilization interrupt clear */
#define RCU_INT_CKMIC                   BIT(23)                   /*!< HXTAL clock Stuck interrupt clear */
#define RCU_INT_LCKMIF                  BIT(27)                   /*!< LXTAL clock stuck interrupt flag */
#define RCU_INT_LCKMIC                  BIT(28)                   /*!< LXTAL clock stuck interrupt clear */

/* RCU_AHB1RST */
#define RCU_AHB1RST_CRCRST              BIT(12)                   /*!< CRC reset */ 
#define RCU_AHB1RST_CLARST              BIT(15)                   /*!< CLA reset */ 
#define RCU_AHB1RST_DMA0RST             BIT(21)                   /*!< DMA0 reset */
#define RCU_AHB1RST_DMA1RST             BIT(22)                   /*!< DMA1 reset */
#define RCU_AHB1RST_DMAMUXRST           BIT(23)                   /*!< DMAMUX reset */
#define RCU_AHB1RST_FFTRST              BIT(31)                   /*!< FFT reset */

/* RCU_AHB2RST */
#define RCU_AHB2RST_FACRST              BIT(1)                    /*!< FAC reset */
#define RCU_AHB2RST_CAURST              BIT(3)                    /*!< CAU reset */
#define RCU_AHB2RST_TRNGRST             BIT(6)                    /*!< TRNG reset */
#define RCU_AHB2RST_TMURST              BIT(7)                    /*!< TMU reset */
#define RCU_AHB2RST_PARST               BIT(17)                   /*!< GPIOA reset */
#define RCU_AHB2RST_PBRST               BIT(18)                   /*!< GPIOB reset */
#define RCU_AHB2RST_PCRST               BIT(19)                   /*!< GPIOC reset */
#define RCU_AHB2RST_PDRST               BIT(20)                   /*!< GPIOD reset */
#define RCU_AHB2RST_PERST               BIT(21)                   /*!< GPIOE reset */
#define RCU_AHB2RST_PFRST               BIT(22)                   /*!< GPIOF reset */
#define RCU_AHB2RST_PGRST               BIT(23)                   /*!< GPIOG reset */

/* RCU_AHB3RST */
#define RCU_AHB3RST_EXMCRST             BIT(0)                    /*!< EXMC reset */
#define RCU_AHB3RST_QSPIRST             BIT(1)                    /*!< QSPI reset */

/* RCU_APB1RST */
#define RCU_APB1RST_TIMER1RST           BIT(0)                    /*!< TIMER1 reset */
#define RCU_APB1RST_TIMER2RST           BIT(1)                    /*!< TIMER2 reset */
#define RCU_APB1RST_TIMER3RST           BIT(2)                    /*!< TIMER3 reset */
#define RCU_APB1RST_TIMER4RST           BIT(3)                    /*!< TIMER4 reset */
#define RCU_APB1RST_TIMER5RST           BIT(4)                    /*!< TIMER5 reset */
#define RCU_APB1RST_TIMER6RST           BIT(5)                    /*!< TIMER6 reset */
#define RCU_APB1RST_LPTIMERRST          BIT(9)                    /*!< LPTIMER timer reset */
#define RCU_APB1RST_WWDGTRST            BIT(11)                   /*!< WWDGT reset */
#define RCU_APB1RST_SPI1RST             BIT(14)                   /*!< SPI1 reset */
#define RCU_APB1RST_SPI2RST             BIT(15)                   /*!< SPI2 reset */
#define RCU_APB1RST_USART1RST           BIT(17)                   /*!< USART1 reset */
#define RCU_APB1RST_USART2RST           BIT(18)                   /*!< USART2 reset */
#define RCU_APB1RST_UART3RST            BIT(19)                   /*!< UART3 reset */
#define RCU_APB1RST_UART4RST            BIT(20)                   /*!< UART4 reset */
#define RCU_APB1RST_I2C0RST             BIT(21)                   /*!< I2C0 reset */
#define RCU_APB1RST_I2C1RST             BIT(22)                   /*!< I2C1 reset */
#define RCU_APB1RST_I2C2RST             BIT(23)                   /*!< I2C2 reset */
#define RCU_APB1RST_I2C3RST             BIT(24)                   /*!< I2C3 reset */
#define RCU_APB1RST_PMURST              BIT(28)                   /*!< PMU reset */

/* RCU_APB2RST */
#define RCU_APB2RST_TIMER0RST           BIT(0)                    /*!< TIMER0 reset */
#define RCU_APB2RST_TIMER7RST           BIT(1)                    /*!< TIMER7 reset */
#define RCU_APB2RST_VREFRST             BIT(2)                    /*!< VREF reset */
#define RCU_APB2RST_CMPRST              BIT(3)                    /*!< CMP reset */
#define RCU_APB2RST_USART0RST           BIT(4)                    /*!< USART0 reset */
#define RCU_APB2RST_CAN0RST             BIT(8)                    /*!< CAN0 reset */
#define RCU_APB2RST_CAN1RST             BIT(9)                    /*!< CAN1 reset */
#define RCU_APB2RST_CAN2RST             BIT(10)                   /*!< CAN2 reset */
#define RCU_APB2RST_SPI0RST             BIT(12)                   /*!< SPI0 reset */
#define RCU_APB2RST_SYSCFGRST           BIT(14)                   /*!< SYSCFG reset */
#define RCU_APB2RST_TIMER19RST          BIT(15)                   /*!< TIMER19 reset */
#define RCU_APB2RST_TIMER14RST          BIT(16)                   /*!< TIMER14 reset */
#define RCU_APB2RST_TIMER15RST          BIT(17)                   /*!< TIMER15 reset */
#define RCU_APB2RST_TIMER16RST          BIT(18)                   /*!< TIMER16 reset */
#define RCU_APB2RST_HPDFRST             BIT(19)                   /*!< HPDF reset */
#define RCU_APB2RST_HRTIMERRST          BIT(29)                   /*!< HRTIMER reset */
#define RCU_APB2RST_TRIGSELRST          BIT(31)                   /*!< TRIGSEL reset */

/* RCU_APB3RST */
#define RCU_APB3RST_ADC0RST             BIT(8)                    /*!< ADC0 reset */
#define RCU_APB3RST_ADC1RST             BIT(9)                    /*!< ADC1 reset */
#define RCU_APB3RST_ADC2RST             BIT(10)                   /*!< ADC2 reset */
#define RCU_APB3RST_ADC3RST             BIT(11)                   /*!< ADC3 reset */
#define RCU_APB3RST_DACHOLDRST          BIT(16)                   /*!< DACHOLD reset */
#define RCU_APB3RST_DAC0RST             BIT(17)                   /*!< DAC0 reset */
#define RCU_APB3RST_DAC1RST             BIT(18)                   /*!< DAC1 reset */
#define RCU_APB3RST_DAC2RST             BIT(19)                   /*!< DAC2 reset */
#define RCU_APB3RST_DAC3RST             BIT(20)                   /*!< DAC3 reset */

/* RCU_AHB1EN */
#define RCU_AHB1EN_CRCEN                BIT(12)                   /*!< CRC clock enable */ 
#define RCU_AHB1EN_CLAEN                BIT(15)                   /*!< CLA clock enable */ 
#define RCU_AHB1EN_DMA0EN               BIT(21)                   /*!< DMA0 clock enable */
#define RCU_AHB1EN_DMA1EN               BIT(22)                   /*!< DMA1 clock enable */
#define RCU_AHB1EN_DMAMUXEN             BIT(23)                   /*!< DMAMUX clock enable */
#define RCU_AHB1EN_FFTEN                BIT(31)                   /*!< FFT clock enable */

/* RCU_AHB2EN */
#define RCU_AHB2EN_FACEN                BIT(1)                    /*!< FAC clock enable */
#define RCU_AHB2EN_CAUEN                BIT(3)                    /*!< CAU clock enable */
#define RCU_AHB2EN_TRNGEN               BIT(6)                    /*!< TRNG clock enable */
#define RCU_AHB2EN_TMUEN                BIT(7)                    /*!< TMU clock enable */
#define RCU_AHB2EN_PAEN                 BIT(17)                   /*!< GPIOA clock enable */
#define RCU_AHB2EN_PBEN                 BIT(18)                   /*!< GPIOB clock enable */
#define RCU_AHB2EN_PCEN                 BIT(19)                   /*!< GPIOC clock enable */
#define RCU_AHB2EN_PDEN                 BIT(20)                   /*!< GPIOD clock enable */
#define RCU_AHB2EN_PEEN                 BIT(21)                   /*!< GPIOE clock enable */
#define RCU_AHB2EN_PFEN                 BIT(22)                   /*!< GPIOF clock enable */
#define RCU_AHB2EN_PGEN                 BIT(23)                   /*!< GPIOG clock enable */

/* RCU_AHB3EN */
#define RCU_AHB3EN_EXMCEN               BIT(0)                    /*!< EXMC clock enable */
#define RCU_AHB3EN_QSPIEN               BIT(1)                    /*!< QSPI clock enable */

/* RCU_APB1EN */
#define RCU_APB1EN_TIMER1EN             BIT(0)                    /*!< TIMER1 clock enable */
#define RCU_APB1EN_TIMER2EN             BIT(1)                    /*!< TIMER2 clock enable */
#define RCU_APB1EN_TIMER3EN             BIT(2)                    /*!< TIMER3 clock enable */
#define RCU_APB1EN_TIMER4EN             BIT(3)                    /*!< TIMER4 clock enable */
#define RCU_APB1EN_TIMER5EN             BIT(4)                    /*!< TIMER5 clock enable */
#define RCU_APB1EN_TIMER6EN             BIT(5)                    /*!< TIMER6 clock enable */
#define RCU_APB1EN_LPTIMEREN            BIT(9)                    /*!< LPTIMER timer clock enable */
#define RCU_APB1EN_WWDGTEN              BIT(11)                   /*!< WWDGT clock enable */
#define RCU_APB1EN_SPI1EN               BIT(14)                   /*!< SPI1 clock enable */
#define RCU_APB1EN_SPI2EN               BIT(15)                   /*!< SPI2 clock enable */
#define RCU_APB1EN_USART1EN             BIT(17)                   /*!< USART1 clock enable */
#define RCU_APB1EN_USART2EN             BIT(18)                   /*!< USART2 clock enable */
#define RCU_APB1EN_UART3EN              BIT(19)                   /*!< UART3 clock enable */
#define RCU_APB1EN_UART4EN              BIT(20)                   /*!< UART4 clock enable */
#define RCU_APB1EN_I2C0EN               BIT(21)                   /*!< I2C0 clock enable */
#define RCU_APB1EN_I2C1EN               BIT(22)                   /*!< I2C1 clock enable */
#define RCU_APB1EN_I2C2EN               BIT(23)                   /*!< I2C2 clock enable */
#define RCU_APB1EN_I2C3EN               BIT(24)                   /*!< I2C3 clock enable */
#define RCU_APB1EN_PMUEN                BIT(28)                   /*!< PMU clock enable */

/* RCU_APB2EN */
#define RCU_APB2EN_TIMER0EN             BIT(0)                    /*!< TIMER0 clock enable */
#define RCU_APB2EN_TIMER7EN             BIT(1)                    /*!< TIMER7 clock enable */
#define RCU_APB2EN_VREFEN               BIT(2)                    /*!< VREF clock enable */
#define RCU_APB2EN_CMPEN                BIT(3)                    /*!< CMP clock enable */
#define RCU_APB2EN_USART0EN             BIT(4)                    /*!< USART0 clock enable */
#define RCU_APB2EN_CAN0EN               BIT(8)                    /*!< CAN0 clock enable */
#define RCU_APB2EN_CAN1EN               BIT(9)                    /*!< CAN1 clock enable */
#define RCU_APB2EN_CAN2EN               BIT(10)                   /*!< CAN2 clock enable */
#define RCU_APB2EN_SPI0EN               BIT(12)                   /*!< SPI0 clock enable */
#define RCU_APB2EN_SYSCFGEN             BIT(14)                   /*!< SYSCFG clock enable */
#define RCU_APB2EN_TIMER19EN            BIT(15)                   /*!< TIMER19 clock enable */
#define RCU_APB2EN_TIMER14EN            BIT(16)                   /*!< TIMER14 clock enable */
#define RCU_APB2EN_TIMER15EN            BIT(17)                   /*!< TIMER15 clock enable */
#define RCU_APB2EN_TIMER16EN            BIT(18)                   /*!< TIMER16 clock enable */
#define RCU_APB2EN_HPDFEN               BIT(19)                   /*!< HPDF clock enable */
#define RCU_APB2EN_HRTIMEREN           BIT(29)                    /*!< HRTIMER clock enable */
#define RCU_APB2EN_TRIGSELEN            BIT(31)                   /*!< TRIGSEL clock enable */

