wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_rcu.h
/* RCU_APB3EN */
#define RCU_APB3EN_ADC0EN               BIT(8)                    /*!< ADC0 clock enable */
#define RCU_APB3EN_ADC1EN               BIT(9)                    /*!< ADC1 clock enable */
#define RCU_APB3EN_ADC2EN               BIT(10)                   /*!< ADC2 clock enable */
#define RCU_APB3EN_ADC3EN               BIT(11)                   /*!< ADC3 clock enable */
#define RCU_APB3EN_DACHOLDEN            BIT(16)                   /*!< DACHOLD clock enable */
#define RCU_APB3EN_DAC0EN               BIT(17)                   /*!< DAC0 clock enable */
#define RCU_APB3EN_DAC1EN               BIT(18)                   /*!< DAC1 clock enable */
#define RCU_APB3EN_DAC2EN               BIT(19)                   /*!< DAC2 clock enable */
#define RCU_APB3EN_DAC3EN               BIT(20)                   /*!< DAC3 clock enable */

/* RCU_AHB1SPDPEN */
#define RCU_AHB1SPDPEN_FMCSPDPEN        BIT(8)                    /*!< FMC clock enable when sleep and deep-sleep mode */
#define RCU_AHB1SPDPEN_CRCSPDPEN        BIT(12)                   /*!< CRC clock enable when sleep and deep-sleep mode */
#define RCU_AHB1SPDPEN_CLASPDPEN        BIT(15)                   /*!< CLA clock enable when sleep and deep-sleep mode */
#define RCU_AHB1SPDPEN_SRAM0SPDPEN      BIT(16)                   /*!< SRAM0 clock enable when sleep and deep-sleep mode */
#define RCU_AHB1SPDPEN_SRAM1SPDPEN      BIT(17)                   /*!< SRAM1 clock enable when sleep and deep-sleep mode */
#define RCU_AHB1SPDPEN_TCMSAMSPDPEN     BIT(19)                   /*!< TCMSRAM clock enable when sleep and deep-sleep mode */
#define RCU_AHB1SPDPEN_DMA0SPDPEN       BIT(21)                   /*!< DMA0 clock enable when sleep and deep-sleep mode */
#define RCU_AHB1SPDPEN_DMA1SPDPEN       BIT(22)                   /*!< DMA1 clock enable when sleep and deep-sleep mode */
#define RCU_AHB1SPDPEN_DMAMUXSPDPEN     BIT(23)                   /*!< DMAMUX clock enable when sleep and deep-sleep mode */
#define RCU_AHB1SPDPEN_FFTSPDPEN        BIT(31)                   /*!< FFT clock enable when sleep and deep-sleep mode */

/* RCU_AHB2SPDPEN */
#define RCU_AHB2SPDPEN_FACSPDPEN        BIT(1)                    /*!< FAC clock enable when sleep and deep-sleep mode */
#define RCU_AHB2SPDPEN_CAUSPDPEN        BIT(3)                    /*!< CAU clock enable when sleep and deep-sleep mode */
#define RCU_AHB2SPDPEN_TRNGSPDPEN       BIT(6)                    /*!< TRNG clock enable when sleep and deep-sleep mode */
#define RCU_AHB2SPDPEN_TMUSPDPEN        BIT(7)                    /*!< TMU clock enable when sleep and deep-sleep mode */
#define RCU_AHB2SPDPEN_PASPDPEN         BIT(17)                   /*!< GPIOA clock enable when sleep and deep-sleep mode */
#define RCU_AHB2SPDPEN_PBSPDPEN         BIT(18)                   /*!< GPIOB clock enable when sleep and deep-sleep mode */
#define RCU_AHB2SPDPEN_PCSPDPEN         BIT(19)                   /*!< GPIOC clock enable when sleep and deep-sleep mode */
#define RCU_AHB2SPDPEN_PDSPDPEN         BIT(20)                   /*!< GPIOD clock enable when sleep and deep-sleep mode */
#define RCU_AHB2SPDPEN_PESPDPEN         BIT(21)                   /*!< GPIOE clock enable when sleep and deep-sleep mode */
#define RCU_AHB2SPDPEN_PFSPDPEN         BIT(22)                   /*!< GPIOF clock enable when sleep and deep-sleep mode */
#define RCU_AHB2SPDPEN_PGSPDPEN         BIT(23)                   /*!< GPIOG clock enable when sleep and deep-sleep mode */

/* RCU_AHB3SPDPEN */
#define RCU_AHB3SPDPEN_EXMCSPDPEN       BIT(0)                    /*!< EXMC clock enable when sleep and deep-sleep mode */
#define RCU_AHB3SPDPEN_QSPISPDPEN       BIT(1)                    /*!< QSPI clock enable when sleep and deep-sleep mode */

/* RCU_APB1SPDPEN */
#define RCU_APB1SPDPEN_TIMER1SPDPEN     BIT(0)                    /*!< TIMER1 clock enable when sleep and deep-sleep mode */
#define RCU_APB1SPDPEN_TIMER2SPDPEN     BIT(1)                    /*!< TIMER2 clock enable when sleep and deep-sleep mode */
#define RCU_APB1SPDPEN_TIMER3SPDPEN     BIT(2)                    /*!< TIMER3 clock enable when sleep and deep-sleep mode */
#define RCU_APB1SPDPEN_TIMER4SPDPEN     BIT(3)                    /*!< TIMER4 clock enable when sleep and deep-sleep mode */
#define RCU_APB1SPDPEN_TIMER5SPDPEN     BIT(4)                    /*!< TIMER5 clock enable when sleep and deep-sleep mode */
#define RCU_APB1SPDPEN_TIMER6SPDPEN     BIT(5)                    /*!< TIMER6 clock enable when sleep and deep-sleep mode */
#define RCU_APB1SPDPEN_LPTIMERSPDPEN    BIT(9)                    /*!< LPTIMER timer clock enable when sleep and deep-sleep mode */
#define RCU_APB1SPDPEN_WWDGTSPDPEN      BIT(11)                   /*!< WWDGT clock enable when sleep and deep-sleep mode */
#define RCU_APB1SPDPEN_SPI1SPDPEN       BIT(14)                   /*!< SPI1 clock enable when sleep and deep-sleep mode */
#define RCU_APB1SPDPEN_SPI2SPDPEN       BIT(15)                   /*!< SPI2 clock enable when sleep and deep-sleep mode */
#define RCU_APB1SPDPEN_USART1SPDPEN     BIT(17)                   /*!< USART1 clock enable when sleep and deep-sleep mode */
#define RCU_APB1SPDPEN_USART2SPDPEN     BIT(18)                   /*!< USART2 clock enable when sleep and deep-sleep mode */
#define RCU_APB1SPDPEN_UART3SPDPEN      BIT(19)                   /*!< UART3 clock enable when sleep and deep-sleep mode */
#define RCU_APB1SPDPEN_UART4SPDPEN      BIT(20)                   /*!< UART4 clock enable when sleep and deep-sleep mode */
#define RCU_APB1SPDPEN_I2C0SPDPEN       BIT(21)                   /*!< I2C0 clock enable when sleep and deep-sleep mode */
#define RCU_APB1SPDPEN_I2C1SPDPEN       BIT(22)                   /*!< I2C1 clock enable when sleep and deep-sleep mode */
#define RCU_APB1SPDPEN_I2C2SPDPEN       BIT(23)                   /*!< I2C2 clock enable when sleep and deep-sleep mode */
#define RCU_APB1SPDPEN_I2C3SPDPEN       BIT(24)                   /*!< I2C3 clock enable when sleep and deep-sleep mode */
#define RCU_APB1SPDPEN_PMUSPDPEN        BIT(28)                   /*!< PMU clock enable when sleep and deep-sleep mode */

