wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_rcu.h
/* RCU_APB2SPDPEN */
#define RCU_APB2SPDPEN_TIMER0SPDPEN     BIT(0)                    /*!< TIMER0 clock enable when sleep and deep-sleep mode */
#define RCU_APB2SPDPEN_TIMER7SPDPEN     BIT(1)                    /*!< TIMER7 clock enable when sleep and deep-sleep mode */
#define RCU_APB2SPDPEN_VREFSPDPEN       BIT(2)                    /*!< VREF clock enable when sleep and deep-sleep mode */
#define RCU_APB2SPDPEN_CMPSPDPEN        BIT(3)                    /*!< CMP clock enable when sleep and deep-sleep mode */
#define RCU_APB2SPDPEN_USART0SPDPEN     BIT(4)                    /*!< USART0 clock enable when sleep and deep-sleep mode */
#define RCU_APB2SPDPEN_CAN0SPDPEN       BIT(8)                    /*!< CAN0 clock enable when sleep and deep-sleep mode */
#define RCU_APB2SPDPEN_CAN1SPDPEN       BIT(9)                    /*!< CAN1 clock enable when sleep and deep-sleep mode */
#define RCU_APB2SPDPEN_CAN2SPDPEN       BIT(10)                   /*!< CAN2 clock enable when sleep and deep-sleep mode */
#define RCU_APB2SPDPEN_SPI0SPDPEN       BIT(12)                   /*!< SPI0 clock enable when sleep and deep-sleep mode */
#define RCU_APB2SPDPEN_SYSCFGSPDPEN     BIT(14)                   /*!< SYSCFG clock enable when sleep and deep-sleep mode */
#define RCU_APB2SPDPEN_TIMER19SPDPEN    BIT(15)                   /*!< TIMER19 clock enable when sleep and deep-sleep mode */
#define RCU_APB2SPDPEN_TIMER14SPDPEN    BIT(16)                   /*!< TIMER14 clock enable when sleep and deep-sleep mode */
#define RCU_APB2SPDPEN_TIMER15SPDPEN    BIT(17)                   /*!< TIMER15 clock enable when sleep and deep-sleep mode */
#define RCU_APB2SPDPEN_TIMER16SPDPEN    BIT(18)                   /*!< TIMER16 clock enable when sleep and deep-sleep mode */
#define RCU_APB2SPDPEN_HPDFSPDPEN       BIT(19)                   /*!< HPDF clock enable when sleep and deep-sleep mode */
#define RCU_APB2SPDPEN_HRTIMERSPDPEN    BIT(29)                   /*!< HRTIMER clock enable when sleep and deep-sleep mode */
#define RCU_APB2SPDPEN_TRIGSELSPDPEN    BIT(31)                   /*!< TRIGSEL clock enable when sleep and deep-sleep mode */

/* RCU_APB3SPDPEN */
#define RCU_APB3SPDPEN_ADC0SPDPEN       BIT(8)                    /*!< ADC0 clock enable when sleep and deep-sleep mode */
#define RCU_APB3SPDPEN_ADC1SPDPEN       BIT(9)                    /*!< ADC1 clock enable when sleep and deep-sleep mode */
#define RCU_APB3SPDPEN_ADC2SPDPEN       BIT(10)                   /*!< ADC2 clock enable when sleep and deep-sleep mode */
#define RCU_APB3SPDPEN_ADC3SPDPEN       BIT(11)                   /*!< ADC3 clock enable when sleep and deep-sleep mode */
#define RCU_APB3SPDPEN_DACHOLDSPDPEN    BIT(16)                   /*!< DACHOLD clock enable when sleep and deep-sleep mode */
#define RCU_APB3SPDPEN_DAC0SPDPEN       BIT(17)                   /*!< DAC0 clock enable when sleep and deep-sleep mode */
#define RCU_APB3SPDPEN_DAC1SPDPEN       BIT(18)                   /*!< DAC1 clock enable when sleep and deep-sleep mode */
#define RCU_APB3SPDPEN_DAC2SPDPEN       BIT(19)                   /*!< DAC2 clock enable when sleep and deep-sleep mode */
#define RCU_APB3SPDPEN_DAC3SPDPEN       BIT(20)                   /*!< DAC3 clock enable when sleep and deep-sleep mode */

/* RCU_BDCTL */
#define RCU_BDCTL_LXTALEN               BIT(0)                    /*!< LXTAL enable */
#define RCU_BDCTL_LXTALSTB              BIT(1)                    /*!< low speed crystal oscillator stabilization flag */
#define RCU_BDCTL_LXTALBPS              BIT(2)                    /*!< LXTAL bypass mode enable */
#define RCU_BDCTL_LXTALDRI              BITS(3,4)                 /*!< LXTAL drive capability */
#define RCU_BDCTL_LCKMEN                BIT(5)                    /*!< LXTAL clock monitor enable */
#define RCU_BDCTL_LCKMD                 BIT(6)                    /*!< LXTAL clock failure detection */
#define RCU_BDCTL_LXTALSTBRST           BIT(7)                    /*!< LXTAL stabilization reset */
#define RCU_BDCTL_RTCSRC                BITS(8,9)                 /*!< RTC clock entry selection */
#define RCU_BDCTL_RTCEN                 BIT(15)                   /*!< RTC clock enable */
#define RCU_BDCTL_BKPRST                BIT(16)                   /*!< backup domain reset */
#define RCU_BDCTL_LSCKOUTEN             BIT(24)                   /*!< Low speed clock output enable */
#define RCU_BDCTL_LSCKOUTSEL            BIT(25)                   /*!< Low speed clock output selection */

/* RCU_RSTSCK */
#define RCU_RSTSCK_IRC32KEN             BIT(0)                    /*!< IRC32K enable */
#define RCU_RSTSCK_IRC32KSTB            BIT(1)                    /*!< IRC32K stabilization flag */
#define RCU_RSTSCK_OBLRSTF              BIT(23)                   /*!< option byte loader reset flag */
#define RCU_RSTSCK_RSTFC                BIT(24)                   /*!< reset flag clear */
#define RCU_RSTSCK_BORRSTF              BIT(25)                   /*!< BOR reset flag */
#define RCU_RSTSCK_EPRSTF               BIT(26)                   /*!< external pin reset flag */
#define RCU_RSTSCK_PORRSTF              BIT(27)                   /*!< power reset flag */
#define RCU_RSTSCK_SWRSTF               BIT(28)                   /*!< software reset flag */
#define RCU_RSTSCK_FWDGTRSTF            BIT(29)                   /*!< free watchdog timer reset flag */
#define RCU_RSTSCK_WWDGTRSTF            BIT(30)                   /*!< window watchdog timer reset flag */
#define RCU_RSTSCK_LPRSTF               BIT(31)                   /*!< low-power reset flag */

/* RCU_CFG1 */
#define RCU_CFG1_USART0SEL              BITS(0,1)                 /*!< USART0 clock selection */
#define RCU_CFG1_CAN0SEL                BITS(8,9)                 /*!< CAN0 clock selection */
#define RCU_CFG1_CAN1SEL                BITS(10,11)               /*!< CAN1 clock selection */
#define RCU_CFG1_CAN2SEL                BITS(12,13)               /*!< CAN2 clock selection */
#define RCU_CFG1_USART1SEL              BITS(18,19)               /*!< USART1 clock selection */
#define RCU_CFG1_USART2SEL              BITS(20,21)               /*!< USART2 clock selection */
#define RCU_CFG1_HPDFAUDIOSEL           BITS(29,30)               /*!< HPDFAUDIO clock selection */
#define RCU_CFG1_HPDFSEL                BIT(31)                   /*!< HPDF clock selection */

