wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_rcu.h
/* RCU_CFG2 */
#define RCU_CFG2_I2C0SEL                BITS(0,1)                 /*!< CK_I2C0 clock source selection */
#define RCU_CFG2_I2C1SEL                BITS(2,3)                 /*!< CK_I2C1 clock source selection */
#define RCU_CFG2_I2C2SEL                BITS(4,5)                 /*!< CK_I2C2 clock source selection */
#define RCU_CFG2_I2C3SEL                BITS(6,7)                 /*!< CK_I2C3 clock source selection */
#define RCU_CFG2_LPTIMERSEL             BITS(9,10)                /*!< CK_LPTIMER clock source selection */
#define RCU_CFG2_TRNGPSC                BITS(13,15)               /*!< TRNG prescaler selection */
#define RCU_CFG2_QSPISEL                BITS(16,17)               /*!< CK_USART0 clock source selection */
#define RCU_CFG2_HRTIMERSEL             BIT(19)                   /*!< HRTIMER clock selection */
#define RCU_CFG2_ADC0_1_2SEL            BITS(26,27)               /*!< CK_ADC0/1/2 clock source selection */
#define RCU_CFG2_ADC3SEL                BITS(28,29)               /*!< CK_ADC3 clock source selection */

/* constants definitions */
/* define the peripheral clock enable bit position and its register index offset */
#define RCU_REGIDX_BIT(regidx, bitpos)  (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos))
#define RCU_REG_VAL(periph)             (REG32(RCU + ((uint32_t)(periph) >> 6)))
#define RCU_BIT_POS(val)                ((uint32_t)(val) & 0x0000001FU)

/* register offset */
/* peripherals enable */
#define AHB1EN_REG_OFFSET               ((uint32_t)0x00000030U)                     /*!< AHB1 enable register offset */
#define AHB2EN_REG_OFFSET               ((uint32_t)0x00000034U)                     /*!< AHB2 enable register offset */
#define AHB3EN_REG_OFFSET               ((uint32_t)0x00000038U)                     /*!< AHB3 enable register offset */
#define APB1EN_REG_OFFSET               ((uint32_t)0x00000040U)                     /*!< APB1 enable register offset */
#define APB2EN_REG_OFFSET               ((uint32_t)0x00000044U)                     /*!< APB2 enable register offset */
#define APB3EN_REG_OFFSET               ((uint32_t)0x00000048U)                     /*!< APB3 enable register offset */
#define AHB1SPDPEN_REG_OFFSET           ((uint32_t)0x00000050U)                     /*!< AHB1 sleep and deep-sleep mode enable register offset */
#define AHB2SPDPEN_REG_OFFSET           ((uint32_t)0x00000054U)                     /*!< AHB2 sleep and deep-sleep mode enable register offset */
#define AHB3SPDPEN_REG_OFFSET           ((uint32_t)0x00000058U)                     /*!< AHB3 sleep and deep-sleep mode enable register offset */
#define APB1SPDPEN_REG_OFFSET           ((uint32_t)0x00000060U)                     /*!< APB1 sleep and deep-sleep mode enable register offset */
#define APB2SPDPEN_REG_OFFSET           ((uint32_t)0x00000064U)                     /*!< APB2 sleep and deep-sleep mode enable register offset */
#define APB3SPDPEN_REG_OFFSET           ((uint32_t)0x00000068U)                     /*!< APB3 sleep and deep-sleep mode enable register offset */

/* peripherals reset */
#define AHB1RST_REG_OFFSET              ((uint32_t)0x00000010U)                     /*!< AHB1 reset register offset */
#define AHB2RST_REG_OFFSET              ((uint32_t)0x00000014U)                     /*!< AHB2 reset register offset */
#define AHB3RST_REG_OFFSET              ((uint32_t)0x00000018U)                     /*!< AHB3 reset register offset */
#define APB1RST_REG_OFFSET              ((uint32_t)0x00000020U)                     /*!< APB1 reset register offset */
#define APB2RST_REG_OFFSET              ((uint32_t)0x00000024U)                     /*!< APB2 reset register offset */
#define APB3RST_REG_OFFSET              ((uint32_t)0x00000028U)                     /*!< APB3 reset register offset */
#define RSTSCK_REG_OFFSET               ((uint32_t)0x00000074U)                     /*!< reset source/clock register offset */

/* clock control */
#define CTL_REG_OFFSET                  ((uint32_t)0x00000000U)                     /*!< control register offset */
#define BDCTL_REG_OFFSET                ((uint32_t)0x00000070U)                     /*!< backup domain control register offset */

/* clock stabilization and stuck interrupt */
#define INT_REG_OFFSET                  ((uint32_t)0x0000000CU)                     /*!< clock interrupt register offset */

/* configuration register */
#define PLL_REG_OFFSET                  ((uint32_t)0x00000004U)                     /*!< PLL register offset */
#define CFG0_REG_OFFSET                 ((uint32_t)0x00000008U)                     /*!< clock configuration register 0 offset */
#define CFG1_REG_OFFSET                 ((uint32_t)0x0000008CU)                     /*!< clock configuration register 1 offset */
#define CFG2_REG_OFFSET                 ((uint32_t)0x00000090U)                     /*!< clock configuration register 2 offset */

/* peripheral clock enable */
typedef enum
{
    /* AHB1 peripherals */
    RCU_CRC        = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 12U),                        /*!< CRC clock */
    RCU_CLA        = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 15U),                        /*!< CLA clock */
    RCU_DMA0       = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 21U),                        /*!< DMA0 clock */
    RCU_DMA1       = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 22U),                        /*!< DMA1 clock */
    RCU_DMAMUX     = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 23U),                        /*!< DMAMUX clock */
    RCU_FFT        = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 31U),                        /*!< FFT clock */
    /* AHB2 peripherals */
    RCU_FAC        = RCU_REGIDX_BIT(AHB2EN_REG_OFFSET, 1U),                         /*!< FAC clock */
    RCU_CAU        = RCU_REGIDX_BIT(AHB2EN_REG_OFFSET, 3U),                         /*!< CAU clock */
    RCU_TRNG       = RCU_REGIDX_BIT(AHB2EN_REG_OFFSET, 6U),                         /*!< TRNG clock */
    RCU_TMU        = RCU_REGIDX_BIT(AHB2EN_REG_OFFSET, 7U),                         /*!< TMU clock */
    RCU_GPIOA      = RCU_REGIDX_BIT(AHB2EN_REG_OFFSET, 17U),                        /*!< GPIOA clock */
    RCU_GPIOB      = RCU_REGIDX_BIT(AHB2EN_REG_OFFSET, 18U),                        /*!< GPIOB clock */
    RCU_GPIOC      = RCU_REGIDX_BIT(AHB2EN_REG_OFFSET, 19U),                        /*!< GPIOC clock */
    RCU_GPIOD      = RCU_REGIDX_BIT(AHB2EN_REG_OFFSET, 20U),                        /*!< GPIOD clock */
    RCU_GPIOE      = RCU_REGIDX_BIT(AHB2EN_REG_OFFSET, 21U),                        /*!< GPIOE clock */
    RCU_GPIOF      = RCU_REGIDX_BIT(AHB2EN_REG_OFFSET, 22U),                        /*!< GPIOF clock */
    RCU_GPIOG      = RCU_REGIDX_BIT(AHB2EN_REG_OFFSET, 23U),                        /*!< GPIOG clock */
    /* AHB3 peripherals */
    RCU_EXMC       = RCU_REGIDX_BIT(AHB3EN_REG_OFFSET, 0U),                         /*!< EXMC clock */
    RCU_QSPI       = RCU_REGIDX_BIT(AHB3EN_REG_OFFSET, 1U),                         /*!< QSPI clock */
    /* APB1 peripherals */
    RCU_TIMER1     = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 0U),                         /*!< TIMER1 clock */
    RCU_TIMER2     = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 1U),                         /*!< TIMER2 clock */
    RCU_TIMER3     = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 2U),                         /*!< TIMER3 clock */
    RCU_TIMER4     = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 3U),                         /*!< TIMER4 clock */
    RCU_TIMER5     = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 4U),                         /*!< TIMER5 clock */
    RCU_TIMER6     = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 5U),                         /*!< TIMER6 clock */
    RCU_LPTIMER    = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 9U),                         /*!< LPTIMER clock */
    RCU_WWDGT      = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 11U),                        /*!< WWDGT clock */
    RCU_SPI1       = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 14U),                        /*!< SPI1 clock */
    RCU_SPI2       = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 15U),                        /*!< SPI2 clock */
    RCU_USART1     = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 17U),                        /*!< USART1 clock */
    RCU_USART2     = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 18U),                        /*!< USART2 clock */
    RCU_UART3      = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 19U),                        /*!< UART3 clock */
    RCU_UART4      = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 20U),                        /*!< UART4 clock */
    RCU_I2C0       = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 21U),                        /*!< I2C0 clock */
    RCU_I2C1       = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 22U),                        /*!< I2C1 clock */
    RCU_I2C2       = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 23U),                        /*!< I2C2 clock */
    RCU_I2C3       = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 24U),                        /*!< I2C3 clock */
    RCU_PMU        = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 28U),                        /*!< PMU clock */
    /* APB2 peripherals */
    RCU_TIMER0     = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 0U),                         /*!< TIMER0 clock */
    RCU_TIMER7     = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 1U),                         /*!< TIMER7 clock */
    RCU_VREF       = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 2U),                         /*!< VREF clock */
    RCU_CMP        = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 3U),                         /*!< CMP clock */
    RCU_USART0     = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 4U),                         /*!< USART0 clock */
    RCU_CAN0       = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 8U),                         /*!< CAN0 clock */
    RCU_CAN1       = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 9U),                         /*!< CAN1 clock */
    RCU_CAN2       = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 10U),                        /*!< CAN2 clock */
    RCU_SPI0       = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 12U),                        /*!< SPI0 clock */
    RCU_SYSCFG     = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 14U),                        /*!< SYSCFG clock */
    RCU_TIMER19    = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 15U),                        /*!< TIMER19 clock */
    RCU_TIMER14    = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 16U),                        /*!< TIMER14 clock */
    RCU_TIMER15    = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 17U),                        /*!< TIMER15 clock */
    RCU_TIMER16    = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 18U),                        /*!< TIMER16 clock */
    RCU_HPDF       = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 19U),                        /*!< HPDF clock */
    RCU_HRTIMER   = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 29U),                         /*!< HRTIMER clock */
    RCU_TRIGSEL     = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 31U),                       /*!< TRIGSEL clock */
    /* APB3 peripherals */
    RCU_ADC0       = RCU_REGIDX_BIT(APB3EN_REG_OFFSET, 8U),                         /*!< ADC0 clock */
    RCU_ADC1       = RCU_REGIDX_BIT(APB3EN_REG_OFFSET, 9U),                         /*!< ADC1 clock */
    RCU_ADC2       = RCU_REGIDX_BIT(APB3EN_REG_OFFSET, 10U),                        /*!< ADC2 clock */
    RCU_ADC3       = RCU_REGIDX_BIT(APB3EN_REG_OFFSET, 11U),                        /*!< ADC3 clock */
    RCU_DACHOLD    = RCU_REGIDX_BIT(APB3EN_REG_OFFSET, 16U),                        /*!< DACHOLD clock */
    RCU_DAC0       = RCU_REGIDX_BIT(APB3EN_REG_OFFSET, 17U),                        /*!< DAC0 clock */
    RCU_DAC1       = RCU_REGIDX_BIT(APB3EN_REG_OFFSET, 18U),                        /*!< DAC1 clock */    
    RCU_DAC2       = RCU_REGIDX_BIT(APB3EN_REG_OFFSET, 19U),                        /*!< DAC2 clock */
    RCU_DAC3       = RCU_REGIDX_BIT(APB3EN_REG_OFFSET, 20U),                        /*!< DAC3 clock */
    RCU_RTC        = RCU_REGIDX_BIT(BDCTL_REG_OFFSET, 15U)                          /*!< RTC clock */
}rcu_periph_enum;

/* peripheral clock enable when sleep and deep-sleep mode*/
typedef enum
{
    /* AHB1 peripherals */
    RCU_CRC_SLP        = RCU_REGIDX_BIT(AHB1SPDPEN_REG_OFFSET, 12U),                /*!< CRC clock when sleep and deep-sleep mode */
    RCU_CLA_SLP        = RCU_REGIDX_BIT(AHB1SPDPEN_REG_OFFSET, 15U),                /*!< CLA clock when sleep and deep-sleep mode */
    RCU_SRAM0_SLP      = RCU_REGIDX_BIT(AHB1SPDPEN_REG_OFFSET, 16U),                /*!< SRAM0 clock when sleep and deep-sleep mode */
    RCU_SRAM1_SLP      = RCU_REGIDX_BIT(AHB1SPDPEN_REG_OFFSET, 17U),                /*!< SRAM1 clock when sleep and deep-sleep mode */
    RCU_TCMSRAM_SLP    = RCU_REGIDX_BIT(AHB1SPDPEN_REG_OFFSET, 19U),                /*!< TCMSRAM clock when sleep and deep-sleep mode */
    RCU_DMA0_SLP       = RCU_REGIDX_BIT(AHB1SPDPEN_REG_OFFSET, 21U),                /*!< DMA0 clock when sleep and deep-sleep mode */
    RCU_DMA1_SLP       = RCU_REGIDX_BIT(AHB1SPDPEN_REG_OFFSET, 22U),                /*!< DMA1 clock when sleep and deep-sleep mode */
    RCU_DMAMUX_SLP     = RCU_REGIDX_BIT(AHB1SPDPEN_REG_OFFSET, 23U),                /*!< DMAMUX clock when sleep and deep-sleep mode */
    RCU_FFT_SLP        = RCU_REGIDX_BIT(AHB1SPDPEN_REG_OFFSET, 31U),                /*!< FFT clock when sleep and deep-sleep mode */
    /* AHB2 peripherals */
    RCU_FAC_SLP        = RCU_REGIDX_BIT(AHB2SPDPEN_REG_OFFSET, 1U),                 /*!< FAC clock when sleep and deep-sleep mode */
    RCU_CAU_SLP        = RCU_REGIDX_BIT(AHB2SPDPEN_REG_OFFSET, 3U),                 /*!< CAU clock when sleep and deep-sleep mode */
    RCU_TRNG_SLP       = RCU_REGIDX_BIT(AHB2SPDPEN_REG_OFFSET, 6U),                 /*!< TRNG clock when sleep and deep-sleep mode */
    RCU_TMU_SLP        = RCU_REGIDX_BIT(AHB2SPDPEN_REG_OFFSET, 7U),                 /*!< TMU clock when sleep and deep-sleep mode */
    RCU_GPIOA_SLP      = RCU_REGIDX_BIT(AHB2SPDPEN_REG_OFFSET, 17U),                /*!< GPIOA clock when sleep and deep-sleep mode */
    RCU_GPIOB_SLP      = RCU_REGIDX_BIT(AHB2SPDPEN_REG_OFFSET, 18U),                /*!< GPIOB clock when sleep and deep-sleep mode */
    RCU_GPIOC_SLP      = RCU_REGIDX_BIT(AHB2SPDPEN_REG_OFFSET, 19U),                /*!< GPIOC clock when sleep and deep-sleep mode */
    RCU_GPIOD_SLP      = RCU_REGIDX_BIT(AHB2SPDPEN_REG_OFFSET, 20U),                /*!< GPIOD clock when sleep and deep-sleep mode */
    RCU_GPIOE_SLP      = RCU_REGIDX_BIT(AHB2SPDPEN_REG_OFFSET, 21U),                /*!< GPIOE clock when sleep and deep-sleep mode */
    RCU_GPIOF_SLP      = RCU_REGIDX_BIT(AHB2SPDPEN_REG_OFFSET, 22U),                /*!< GPIOF clock when sleep and deep-sleep mode */
    RCU_GPIOG_SLP      = RCU_REGIDX_BIT(AHB2SPDPEN_REG_OFFSET, 23U),                /*!< GPIOG clock when sleep and deep-sleep mode */
    /* AHB3 peripherals */
    RCU_EXMC_SLP       = RCU_REGIDX_BIT(AHB3SPDPEN_REG_OFFSET, 0U),                 /*!< EXMC clock when sleep and deep-sleep mode */
    RCU_QSPI_SLP       = RCU_REGIDX_BIT(AHB3SPDPEN_REG_OFFSET, 1U),                 /*!< QSPI clock when sleep and deep-sleep mode */
    /* APB1 peripherals */
    RCU_TIMER1_SLP     = RCU_REGIDX_BIT(APB1SPDPEN_REG_OFFSET, 0U),                 /*!< TIMER1 clock when sleep and deep-sleep mode */
    RCU_TIMER2_SLP     = RCU_REGIDX_BIT(APB1SPDPEN_REG_OFFSET, 1U),                 /*!< TIMER2 clock when sleep and deep-sleep mode */
    RCU_TIMER3_SLP     = RCU_REGIDX_BIT(APB1SPDPEN_REG_OFFSET, 2U),                 /*!< TIMER3 clock when sleep and deep-sleep mode */
    RCU_TIMER4_SLP     = RCU_REGIDX_BIT(APB1SPDPEN_REG_OFFSET, 3U),                 /*!< TIMER4 clock when sleep and deep-sleep mode */
    RCU_TIMER5_SLP     = RCU_REGIDX_BIT(APB1SPDPEN_REG_OFFSET, 4U),                 /*!< TIMER5 clock when sleep and deep-sleep mode */
    RCU_TIMER6_SLP     = RCU_REGIDX_BIT(APB1SPDPEN_REG_OFFSET, 5U),                 /*!< TIMER6 clock when sleep and deep-sleep mode */
    RCU_LPTIMER_SLP    = RCU_REGIDX_BIT(APB1SPDPEN_REG_OFFSET, 9U),                 /*!< LPTIMER clock when sleep and deep-sleep mode */
    RCU_WWDGT_SLP      = RCU_REGIDX_BIT(APB1SPDPEN_REG_OFFSET, 11U),                /*!< WWDGT clock when sleep and deep-sleep mode */
    RCU_SPI1_SLP       = RCU_REGIDX_BIT(APB1SPDPEN_REG_OFFSET, 14U),                /*!< SPI1 clock when sleep and deep-sleep mode */
    RCU_SPI2_SLP       = RCU_REGIDX_BIT(APB1SPDPEN_REG_OFFSET, 15U),                /*!< SPI2 clock when sleep and deep-sleep mode */
    RCU_USART1_SLP     = RCU_REGIDX_BIT(APB1SPDPEN_REG_OFFSET, 17U),                /*!< USART1 clock when sleep and deep-sleep mode */
    RCU_USART2_SLP     = RCU_REGIDX_BIT(APB1SPDPEN_REG_OFFSET, 18U),                /*!< USART2 clock when sleep and deep-sleep mode */
    RCU_UART3_SLP      = RCU_REGIDX_BIT(APB1SPDPEN_REG_OFFSET, 19U),                /*!< UART3 clock when sleep and deep-sleep mode */
    RCU_UART4_SLP      = RCU_REGIDX_BIT(APB1SPDPEN_REG_OFFSET, 20U),                /*!< UART4 clock when sleep and deep-sleep mode */
    RCU_I2C0_SLP       = RCU_REGIDX_BIT(APB1SPDPEN_REG_OFFSET, 21U),                /*!< I2C0 clock when sleep and deep-sleep mode */
    RCU_I2C1_SLP       = RCU_REGIDX_BIT(APB1SPDPEN_REG_OFFSET, 22U),                /*!< I2C1 clock when sleep and deep-sleep mode */
    RCU_I2C2_SLP       = RCU_REGIDX_BIT(APB1SPDPEN_REG_OFFSET, 23U),                /*!< I2C2 clock when sleep and deep-sleep mode */
    RCU_I2C3_SLP       = RCU_REGIDX_BIT(APB1SPDPEN_REG_OFFSET, 24U),                /*!< I2C3 clock when sleep and deep-sleep mode */
    RCU_PMU_SLP        = RCU_REGIDX_BIT(APB1SPDPEN_REG_OFFSET, 28U),                /*!< PMU clock when sleep and deep-sleep mode */
    /* APB2 peripherals */
    RCU_TIMER0_SLP     = RCU_REGIDX_BIT(APB2SPDPEN_REG_OFFSET, 0U),                 /*!< TIMER0 clock when sleep and deep-sleep mode */
    RCU_TIMER7_SLP     = RCU_REGIDX_BIT(APB2SPDPEN_REG_OFFSET, 1U),                 /*!< TIMER7 clock when sleep and deep-sleep mode */
    RCU_VREF_SLP       = RCU_REGIDX_BIT(APB2SPDPEN_REG_OFFSET, 2U),                 /*!< VREF clock when sleep and deep-sleep mode */
    RCU_CMP_SLP        = RCU_REGIDX_BIT(APB2SPDPEN_REG_OFFSET, 3U),                 /*!< CMP clock when sleep and deep-sleep mode */
    RCU_USART0_SLP     = RCU_REGIDX_BIT(APB2SPDPEN_REG_OFFSET, 4U),                 /*!< USART0 clock when sleep and deep-sleep mode */
    RCU_CAN0_SLP       = RCU_REGIDX_BIT(APB2SPDPEN_REG_OFFSET, 8U),                 /*!< CAN0 clock when sleep and deep-sleep mode */
    RCU_CAN1_SLP       = RCU_REGIDX_BIT(APB2SPDPEN_REG_OFFSET, 9U),                 /*!< CAN1 clock when sleep and deep-sleep mode */
    RCU_CAN2_SLP       = RCU_REGIDX_BIT(APB2SPDPEN_REG_OFFSET, 10U),                /*!< CAN2 clock when sleep and deep-sleep mode */
    RCU_SPI0_SLP       = RCU_REGIDX_BIT(APB2SPDPEN_REG_OFFSET, 12U),                /*!< SPI0 clock when sleep and deep-sleep mode */
    RCU_SYSCFG_SLP     = RCU_REGIDX_BIT(APB2SPDPEN_REG_OFFSET, 14U),                /*!< SYSCFG clock when sleep and deep-sleep mode */
    RCU_TIMER19_SLP    = RCU_REGIDX_BIT(APB2SPDPEN_REG_OFFSET, 15U),                /*!< TIMER19 clock when sleep and deep-sleep mode */
    RCU_TIMER14_SLP    = RCU_REGIDX_BIT(APB2SPDPEN_REG_OFFSET, 16U),                /*!< TIMER14 clock when sleep and deep-sleep mode */
    RCU_TIMER15_SLP    = RCU_REGIDX_BIT(APB2SPDPEN_REG_OFFSET, 17U),                /*!< TIMER15 clock when sleep and deep-sleep mode */
    RCU_TIMER16_SLP    = RCU_REGIDX_BIT(APB2SPDPEN_REG_OFFSET, 18U),                /*!< TIMER16 clock when sleep and deep-sleep mode */
    RCU_HPDF_SLP       = RCU_REGIDX_BIT(APB2SPDPEN_REG_OFFSET, 19U),                /*!< HPDF clock when sleep and deep-sleep mode */
    RCU_HRTIMER_SLP   = RCU_REGIDX_BIT(APB2SPDPEN_REG_OFFSET, 29U),                 /*!< HRTIMER clock when sleep and deep-sleep mode */
    RCU_TRIGSEL_SLP     = RCU_REGIDX_BIT(APB2SPDPEN_REG_OFFSET, 31U),               /*!< TRIGSEL clock when sleep and deep-sleep mode */
    /* APB3 peripherals */
    RCU_ADC0_SLP       = RCU_REGIDX_BIT(APB3SPDPEN_REG_OFFSET, 8U),                 /*!< ADC0 clock when sleep and deep-sleep mode */
    RCU_ADC1_SLP       = RCU_REGIDX_BIT(APB3SPDPEN_REG_OFFSET, 9U),                 /*!< ADC1 clock when sleep and deep-sleep mode */
    RCU_ADC2_SLP       = RCU_REGIDX_BIT(APB3SPDPEN_REG_OFFSET, 10U),                /*!< ADC2 clock when sleep and deep-sleep mode */
    RCU_ADC3_SLP       = RCU_REGIDX_BIT(APB3SPDPEN_REG_OFFSET, 11U),                /*!< ADC3 clock when sleep and deep-sleep mode */
    RCU_DACHOLD_SLP    = RCU_REGIDX_BIT(APB3SPDPEN_REG_OFFSET, 16U),                /*!< DACHOLD clock when sleep and deep-sleep mode */
    RCU_DAC0_SLP       = RCU_REGIDX_BIT(APB3SPDPEN_REG_OFFSET, 17U),                /*!< DAC0 clock when sleep and deep-sleep mode */
    RCU_DAC1_SLP       = RCU_REGIDX_BIT(APB3SPDPEN_REG_OFFSET, 18U),                /*!< DAC1 clock when sleep and deep-sleep mode */
    RCU_DAC2_SLP       = RCU_REGIDX_BIT(APB3SPDPEN_REG_OFFSET, 19U),                /*!< DAC2 clock when sleep and deep-sleep mode */
    RCU_DAC3_SLP       = RCU_REGIDX_BIT(APB3SPDPEN_REG_OFFSET, 20U)                 /*!< DAC3 clock when sleep and deep-sleep mode */
}rcu_periph_sleep_enum;

