wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_rcu.h
/* peripherals reset */
typedef enum
{
    /* AHB1 peripherals */
    RCU_CRCRST        = RCU_REGIDX_BIT(AHB1RST_REG_OFFSET, 12U),                    /*!< reset CRC */
    RCU_CLARST        = RCU_REGIDX_BIT(AHB1RST_REG_OFFSET, 15U),                    /*!< reset CLA */
    RCU_DMA0RST       = RCU_REGIDX_BIT(AHB1RST_REG_OFFSET, 21U),                    /*!< reset DMA0 */
    RCU_DMA1RST       = RCU_REGIDX_BIT(AHB1RST_REG_OFFSET, 22U),                    /*!< reset DMA1 */
    RCU_DMAMUXRST     = RCU_REGIDX_BIT(AHB1RST_REG_OFFSET, 23U),                    /*!< reset DMAMUX */
    RCU_FFTRST        = RCU_REGIDX_BIT(AHB1RST_REG_OFFSET, 31U),                    /*!< reset FFT */
    /* AHB2 peripherals */
    RCU_FACRST        = RCU_REGIDX_BIT(AHB2RST_REG_OFFSET, 1U),                     /*!< reset FAC */
    RCU_CAURST        = RCU_REGIDX_BIT(AHB2RST_REG_OFFSET, 3U),                     /*!< reset CAU */
    RCU_TRNGRST       = RCU_REGIDX_BIT(AHB2RST_REG_OFFSET, 6U),                     /*!< reset TRNG */
    RCU_TMURST        = RCU_REGIDX_BIT(AHB2RST_REG_OFFSET, 7U),                     /*!< reset TMU */
    RCU_GPIOARST      = RCU_REGIDX_BIT(AHB2RST_REG_OFFSET, 17U),                    /*!< reset GPIOA */
    RCU_GPIOBRST      = RCU_REGIDX_BIT(AHB2RST_REG_OFFSET, 18U),                    /*!< reset GPIOB */
    RCU_GPIOCRST      = RCU_REGIDX_BIT(AHB2RST_REG_OFFSET, 19U),                    /*!< reset GPIOC */
    RCU_GPIODRST      = RCU_REGIDX_BIT(AHB2RST_REG_OFFSET, 20U),                    /*!< reset GPIOD */
    RCU_GPIOERST      = RCU_REGIDX_BIT(AHB2RST_REG_OFFSET, 21U),                    /*!< reset GPIOE */
    RCU_GPIOFRST      = RCU_REGIDX_BIT(AHB2RST_REG_OFFSET, 22U),                    /*!< reset GPIOF */
    RCU_GPIOGRST      = RCU_REGIDX_BIT(AHB2RST_REG_OFFSET, 23U),                    /*!< reset GPIOG */
    /* AHB3 peripherals */
    RCU_EXMCRST       = RCU_REGIDX_BIT(AHB3RST_REG_OFFSET, 0U),                     /*!< reset EXMC */
    RCU_QSPIRST       = RCU_REGIDX_BIT(AHB3RST_REG_OFFSET, 1U),                     /*!< reset QSPI */
    /* APB1 peripherals */
    RCU_TIMER1RST     = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 0U),                     /*!< reset TIMER1 */
    RCU_TIMER2RST     = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 1U),                     /*!< reset TIMER2 */
    RCU_TIMER3RST     = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 2U),                     /*!< reset TIMER3 */
    RCU_TIMER4RST     = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 3U),                     /*!< reset TIMER4 */
    RCU_TIMER5RST     = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 4U),                     /*!< reset TIMER5 */
    RCU_TIMER6RST     = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 5U),                     /*!< reset TIMER6 */
    RCU_LPTIMERRST    = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 9U),                     /*!< reset LPTIMER */
    RCU_WWDGTRST      = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 11U),                    /*!< reset TIMER51 */
    RCU_SPI1RST       = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 14U),                    /*!< reset SPI1 */
    RCU_SPI2RST       = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 15U),                    /*!< reset SPI2 */
    RCU_USART1RST     = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 17U),                    /*!< reset USART1 */
    RCU_USART2RST     = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 18U),                    /*!< reset USART2 */
    RCU_UART3RST      = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 19U),                    /*!< reset UART3 */
    RCU_UART4RST      = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 20U),                    /*!< reset UART4 */
    RCU_I2C0RST       = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 21U),                    /*!< reset I2C0 */
    RCU_I2C1RST       = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 22U),                    /*!< reset I2C1 */
    RCU_I2C2RST       = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 23U),                    /*!< reset I2C2 */
    RCU_I2C3RST       = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 24U),                    /*!< reset I2C3 */
    RCU_PMURST        = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 28U),                    /*!< reset PMU */
    /* APB2 peripherals */
    RCU_TIMER0RST     = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 0U),                     /*!< reset TIMER0 */
    RCU_TIMER7RST     = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 1U),                     /*!< reset TIMER7 */
    RCU_VREFRST       = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 2U),                     /*!< reset VREF */
    RCU_CMPRST        = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 3U),                     /*!< reset CMP */
    RCU_USART0RST     = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 4U),                     /*!< reset USART0 */
    RCU_CAN0RST       = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 8U),                     /*!< reset CAN0 */
    RCU_CAN1RST       = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 9U),                     /*!< reset CAN1 */
    RCU_CAN2RST       = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 10U),                    /*!< reset CAN2 */
    RCU_SPI0RST       = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 12U),                    /*!< reset SPI0 */
    RCU_SYSCFGRST     = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 14U),                    /*!< reset SYSCFG */
    RCU_TIMER19RST    = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 15U),                    /*!< reset TIMER19 */
    RCU_TIMER14RST    = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 16U),                    /*!< reset TIMER14 */
    RCU_TIMER15RST    = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 17U),                    /*!< reset TIMER15 */
    RCU_TIMER16RST    = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 18U),                    /*!< reset TIMER16 */
    RCU_HPDFRST       = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 19U),                    /*!< reset HPDF */
    RCU_HRTIMERRST    = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 29U),                    /*!< reset HRTIMER */
    RCU_TRIGSELRST     = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 31U),                   /*!< reset TRIGSEL */
    /* APB3 peripherals */
    RCU_ADC0RST       = RCU_REGIDX_BIT(APB3RST_REG_OFFSET, 8U),                     /*!< reset ADC0 */
    RCU_ADC1RST       = RCU_REGIDX_BIT(APB3RST_REG_OFFSET, 9U),                     /*!< reset ADC1 */
    RCU_ADC2RST       = RCU_REGIDX_BIT(APB3RST_REG_OFFSET, 10U),                    /*!< reset ADC2 */
    RCU_ADC3RST       = RCU_REGIDX_BIT(APB3RST_REG_OFFSET, 11U),                    /*!< reset ADC3 */
    RCU_DACHOLDRST    = RCU_REGIDX_BIT(APB3RST_REG_OFFSET, 16U),                    /*!< reset DACHOLD */
    RCU_DAC0RST       = RCU_REGIDX_BIT(APB3RST_REG_OFFSET, 17U),                    /*!< reset DAC0 */
    RCU_DAC1RST       = RCU_REGIDX_BIT(APB3RST_REG_OFFSET, 18U),                    /*!< reset DAC1 */
    RCU_DAC2RST       = RCU_REGIDX_BIT(APB3RST_REG_OFFSET, 19U),                    /*!< reset DAC2 */
    RCU_DAC3RST       = RCU_REGIDX_BIT(APB3RST_REG_OFFSET, 20U)                     /*!< reset DAC3 */
}rcu_periph_reset_enum;

/* clock stabilization and peripheral reset flags */
typedef enum
{
    /* clock stabilization flags */
    RCU_FLAG_IRC8MSTB      = RCU_REGIDX_BIT(CTL_REG_OFFSET, 1U),            /*!< IRC8M stabilization flag */
    RCU_FLAG_HXTALSTB      = RCU_REGIDX_BIT(CTL_REG_OFFSET, 17U),           /*!< HXTAL stabilization flag */
    RCU_FLAG_PLLSTB        = RCU_REGIDX_BIT(CTL_REG_OFFSET, 25U),           /*!< PLL stabilization flag */
    RCU_FLAG_LXTALSTB      = RCU_REGIDX_BIT(BDCTL_REG_OFFSET, 1U),          /*!< LXTAL stabilization flag */
    RCU_FLAG_IRC32KSTB     = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 1U),         /*!< IRC32K stabilization flag */
    /* reset source flags */
    RCU_FLAG_OBLRST        = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 23U),        /*!< OBL reset flag */
    RCU_FLAG_BORRST        = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 25U),        /*!< BOR reset flag */
    RCU_FLAG_EPRST         = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 26U),        /*!< external PIN reset flag */
    RCU_FLAG_PORRST        = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 27U),        /*!< power reset flag */
    RCU_FLAG_SWRST         = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 28U),        /*!< software reset flag */
    RCU_FLAG_FWDGTRST      = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 29U),        /*!< FWDGT reset flag */
    RCU_FLAG_WWDGTRST      = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 30U),        /*!< WWDGT reset flag */
    RCU_FLAG_LPRST         = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 31U)         /*!< low-power reset flag */
}rcu_flag_enum;

/* clock stabilization and ckm interrupt flags */
typedef enum
{
    RCU_INT_FLAG_IRC32KSTB = RCU_REGIDX_BIT(INT_REG_OFFSET, 0U),            /*!< IRC32K stabilization interrupt flag */
    RCU_INT_FLAG_LXTALSTB  = RCU_REGIDX_BIT(INT_REG_OFFSET, 1U),            /*!< LXTAL stabilization interrupt flag */
    RCU_INT_FLAG_IRC8MSTB  = RCU_REGIDX_BIT(INT_REG_OFFSET, 2U),            /*!< IRC8M stabilization interrupt flag */
    RCU_INT_FLAG_HXTALSTB  = RCU_REGIDX_BIT(INT_REG_OFFSET, 3U),            /*!< HXTAL stabilization interrupt flag */
    RCU_INT_FLAG_PLLSTB    = RCU_REGIDX_BIT(INT_REG_OFFSET, 4U),            /*!< PLL stabilization interrupt flag */
    RCU_INT_FLAG_CKM       = RCU_REGIDX_BIT(INT_REG_OFFSET, 7U),            /*!< HXTAL clock stuck interrupt flag */
    RCU_INT_FLAG_LCKM      = RCU_REGIDX_BIT(INT_REG_OFFSET, 27U)            /*!< LXTAL clock stuck interrupt flag */
}rcu_int_flag_enum;

