wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_rcu.h
/* APB3 prescaler selection */
#define CFG0_APB3PSC(regval)            (BITS(27,29) & ((uint32_t)(regval) << 27))
#define RCU_APB3_CKAHB_DIV1             CFG0_APB3PSC(0)                    /*!< APB3 prescaler select CK_AHB */
#define RCU_APB3_CKAHB_DIV2             CFG0_APB3PSC(4)                    /*!< APB3 prescaler select CK_AHB/2 */
#define RCU_APB3_CKAHB_DIV4             CFG0_APB3PSC(5)                    /*!< APB3 prescaler select CK_AHB/4 */
#define RCU_APB3_CKAHB_DIV8             CFG0_APB3PSC(6)                    /*!< APB3 prescaler select CK_AHB/8 */
#define RCU_APB3_CKAHB_DIV16            CFG0_APB3PSC(7)                    /*!< APB3 prescaler select CK_AHB/16 */

/* CKOUT clock source selection */
#define CFG0_CKOUTSEL(regval)           (BITS(21,23) & ((uint32_t)(regval) << 21))
#define RCU_CKOUTSRC_IRC32K             CFG0_CKOUTSEL(2)                  /*!< internal 32K RC oscillator clock selected */
#define RCU_CKOUTSRC_LXTAL              CFG0_CKOUTSEL(3)                  /*!< low speed crystal oscillator clock (LXTAL) selected */
#define RCU_CKOUTSRC_CKSYS              CFG0_CKOUTSEL(4)                  /*!< system clock selected */
#define RCU_CKOUTSRC_IRC8M              CFG0_CKOUTSEL(5)                  /*!< internal 8M RC oscillator clock selected */
#define RCU_CKOUTSRC_HXTAL              CFG0_CKOUTSEL(6)                  /*!< high speed crystal oscillator clock (HXTAL) selected */
#define RCU_CKOUTSRC_PLLP               CFG0_CKOUTSEL(7)                  /*!< CK_PLL clock selected */

/* CK_OUT divider */
#define CFG0_CKOUTDIV(regval)           (BITS(24,26) & ((uint32_t)(regval) << 24))
#define RCU_CKOUT_DIV1                  CFG0_CKOUTDIV(0)                  /*!< CK_OUT is divided by 1 */
#define RCU_CKOUT_DIV2                  CFG0_CKOUTDIV(1)                  /*!< CK_OUT is divided by 2 */
#define RCU_CKOUT_DIV4                  CFG0_CKOUTDIV(2)                  /*!< CK_OUT is divided by 4 */
#define RCU_CKOUT_DIV8                  CFG0_CKOUTDIV(3)                  /*!< CK_OUT is divided by 8 */
#define RCU_CKOUT_DIV16                 CFG0_CKOUTDIV(4)                  /*!< CK_OUT is divided by 16 */

/* RCU_PLL register bit define */
/* PLL clock source selection */
#define RCU_PLLSRC_IRC8M                ((uint32_t)0x00000000U)           /*!< HXTAL clock selected as source clock of PLL */
#define RCU_PLLSRC_HXTAL                RCU_PLL_PLLSEL                    /*!< IRC8M selected as source clock of PLL */

/* PLL P/Q/R divider output enable */
#define RCU_PLLP                        RCU_PLL_PLLPEN                    /*!< PLLP divider output enable */
#define RCU_PLLQ                        RCU_PLL_PLLQEN                    /*!< PLLQ divider output enable */
#define RCU_PLLR                        RCU_PLL_PLLREN                    /*!< PLLR divider output enable */

/* The PLL VCO source clock prescaler */
#define RCU_PLLPSC_DIV_MIN              ((uint32_t)1U)                    /*!< PLLPSC_DIV min value */
#define RCU_PLLPSC_DIV_MAX              ((uint32_t)16U)                   /*!< PLLPSC_DIV max value */

/* The PLL VCO clock multiplication factor */
#define RCU_PLLN_MUL_MIN                ((uint32_t)8U)                    /*!< PLLN_MUL min value */
#define RCU_PLLN_MUL_MAX                ((uint32_t)180U)                  /*!< PLLN_MUL max value */

/* The PLLP output frequency division factor from PLL VCO clock */
#define RCU_PLLP_DIV_MIN                ((uint32_t)2U)                    /*!< PLLP_DIV min value */
#define RCU_PLLP_DIV_MAX                ((uint32_t)8U)                    /*!< PLLP_DIV max value */

/* The PLLR output frequency division factor from PLL VCO clock */
#define RCU_PLLR_DIV_MIN                ((uint32_t)2U)                    /*!< PLLR_DIV min value */
#define RCU_PLLR_DIV_MAX                ((uint32_t)31U)                   /*!< PLLR_DIV max value */

/* The PLLQ output frequency division factor from PLL0 VCO clock */
#define RCU_PLLQ_DIV_MIN                ((uint32_t)2U)                    /*!< PLLQ_DIV min value */
#define RCU_PLLQ_DIV_MAX                ((uint32_t)15U)                   /*!< PLLQ_DIV max value */

#define CHECK_PLL_PSC_VALID(val)    (((val) >= RCU_PLLPSC_DIV_MIN)&&((val) <= RCU_PLLPSC_DIV_MAX))
#define CHECK_PLL_N_VALID(val)      (((val) >= RCU_PLLN_MUL_MIN) &&((val) <= RCU_PLLN_MUL_MAX))
#define CHECK_PLL_P_VALID(val)      (((val) >= RCU_PLLP_DIV_MIN)&&((val) <= RCU_PLLP_DIV_MAX))
#define CHECK_PLL_Q_VALID(val)      (((val) >= RCU_PLLQ_DIV_MIN)&&((val) <= RCU_PLLQ_DIV_MAX))
#define CHECK_PLL_R_VALID(val)      (((val) >= RCU_PLLR_DIV_MIN)&&((val) <= RCU_PLLR_DIV_MAX))

/* RCU_BDCTL register bit define */
/* LXTAL drive capability */
#define BDCTL_LXTALDRI(regval)       (BITS(3,4) & ((uint32_t)(regval) << 3U))
#define RCU_LXTAL_LOWDRI             BDCTL_LXTALDRI(1)                               /*!< low driving capability */
#define RCU_LXTAL_MEDDRI             BDCTL_LXTALDRI(2)                               /*!< medium driving capability */
#define RCU_LXTAL_HIGHDRI            BDCTL_LXTALDRI(3)                               /*!< high driving capability */

/* RTC clock entry selection */
#define BDCTL_RTCSRC(regval)            (BITS(8,9) & ((uint32_t)(regval) << 8U))
#define RCU_RTCSRC_NONE                 BDCTL_RTCSRC(0)                              /*!< no clock selected */
#define RCU_RTCSRC_LXTAL                BDCTL_RTCSRC(1)                              /*!< RTC source clock select LXTAL */
#define RCU_RTCSRC_IRC32K               BDCTL_RTCSRC(2)                              /*!< RTC source clock select IRC32K */
#define RCU_RTCSRC_HXTAL_DIV32          BDCTL_RTCSRC(3)                              /*!< RTC source clock select HXTAL/32 */

/* low speed clock output source selection */
#define RCU_LSCKOUTSRC_IRC32K           (uint32_t)(0X00000000U)                      /*!< IRC32K clock selected */
#define RCU_LSCKOUTSRC_LXTAL            RCU_BDCTL_LSCKOUTSEL                         /*!< LXTAL clock selected */

/* RCU_CFG1 register bit define */
/* USARTx(x=0,1,2) clock source selection */
#define CFG1_USART0SEL(regval)          (BITS(0,1) & ((uint32_t)(regval) << 0U))
#define RCU_USARTSRC_APB                CFG1_USART0SEL(0)                            /*!< CK_USART select CK_APB */
#define RCU_USARTSRC_CKSYS              CFG1_USART0SEL(1)                            /*!< CK_USART select CK_SYS */
#define RCU_USARTSRC_LXTAL              CFG1_USART0SEL(2)                            /*!< CK_USART select CK_LXTAL */
#define RCU_USARTSRC_IRC8M              CFG1_USART0SEL(3)                            /*!< CK_USART select CK_IRC8M */

