wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_rcu.h
/* CANx(x=0,1,2) clock source selection */
#define CFG1_CAN0SEL(regval)            (BITS(8,9) & ((uint32_t)(regval) << 8U))
#define RCU_CANSRC_IRC8M                CFG1_CAN0SEL(0)                              /*!< CK_CAN select IRC8M */
#define RCU_CANSRC_APB2                 CFG1_CAN0SEL(1)                              /*!< CK_CAN select CK_APB2 */
#define RCU_CANSRC_PLLQ                 CFG1_CAN0SEL(2)                              /*!< CK_CAN select PLLQ */
#define RCU_CANSRC_HXTAL                CFG1_CAN0SEL(3)                              /*!< CK_CAN select CK_HXTAL */

/* HPDF clock source selection */
#define RCU_HPDFSRC_APB2                (uint32_t)(0X00000000U)                      /*!< CK_HPDF select CK_APB2 */
#define RCU_HPDFSRC_AHB                 RCU_CFG1_HPDFSEL                             /*!< CK_HPDF select CK_AHB */

/* HPDF AUDIO clock source selection */
#define CFG1_HPDFAUDIOSEL(regval)       (BITS(29,30) & ((uint32_t)(regval) << 29U))
#define RCU_HPDFAUDIO_PLLQ              CFG1_HPDFAUDIOSEL(0)                         /*!< CK_HPDFAUDIO select IRC8M */
#define RCU_HPDFAUDIO_EHPDFAUDIOPIN     CFG1_HPDFAUDIOSEL(1)                         /*!< CK_HPDFAUDIO select external HPDF_AUDIO pin */
#define RCU_HPDFAUDIO_IRC8M             CFG1_HPDFAUDIOSEL(2)                         /*!< CK_HPDFAUDIO select CK_PLLQ */

/* RCU_CFG2 register bit define */
/* I2Cx(x=0,1,2,3) clock source selection */
#define CFG2_I2C0SRC(regval)            (BITS(0,1) & ((uint32_t)(regval) << 0))
#define RCU_I2CSRC_APB1                 CFG2_I2C0SRC(0)                              /*!< APB1 clock selected as I2C source clock */
#define RCU_I2CSRC_CKSYS                CFG2_I2C0SRC(1)                              /*!< system clock selected as I2C source clock */
#define RCU_I2CSRC_IRC8M                CFG2_I2C0SRC(2)                              /*!< CK_IRC8M clock selected as I2C source clock */

/* LPTIMER clock source selection */
#define CFG2_LPTIMERSEL(regval)         (BITS(9,10) & ((uint32_t)(regval) << 9U))
#define RCU_LPTIMERSRC_APB1             CFG2_LPTIMERSEL(0)                           /*!< CK_LPTIMER select CK_APB1 */
#define RCU_LPTIMERSRC_IRC32K           CFG2_LPTIMERSEL(1)                           /*!< CK_LPTIMER select CK_IRC32K */
#define RCU_LPTIMERSRC_LXTAL            CFG2_LPTIMERSEL(2)                           /*!< CK_LPTIMER select LXTAL */
#define RCU_LPTIMERSRC_IRC8M            CFG2_LPTIMERSEL(3)                           /*!< CK_LPTIMER select IRC8M */

/* TRNG prescaler selection */
#define CFG2_TRNGPSC(regval)            (BITS(12,15) & ((uint32_t)(regval) << 12))
#define RCU_TRNG_CKPLLQ_DIV2            CFG2_TRNGPSC(2)                              /*!< TRNG prescaler select CK_PLLQ/2 */
#define RCU_TRNG_CKPLLQ_DIV3            CFG2_TRNGPSC(3)                              /*!< TRNG prescaler select CK_PLLQ/3 */
#define RCU_TRNG_CKPLLQ_DIV4            CFG2_TRNGPSC(4)                              /*!< TRNG prescaler select CK_PLLQ/4 */
#define RCU_TRNG_CKPLLQ_DIV5            CFG2_TRNGPSC(5)                              /*!< TRNG prescaler select CK_PLLQ/5 */
#define RCU_TRNG_CKPLLQ_DIV6            CFG2_TRNGPSC(6)                              /*!< TRNG prescaler select CK_PLLQ/6 */
#define RCU_TRNG_CKPLLQ_DIV7            CFG2_TRNGPSC(7)                              /*!< TRNG prescaler select CK_PLLQ/7 */
#define RCU_TRNG_CKPLLQ_DIV8            CFG2_TRNGPSC(8)                              /*!< TRNG prescaler select CK_PLLQ/8 */
#define RCU_TRNG_CKPLLQ_DIV9            CFG2_TRNGPSC(9)                              /*!< TRNG prescaler select CK_PLLQ/9 */
#define RCU_TRNG_CKPLLQ_DIV10           CFG2_TRNGPSC(10)                             /*!< TRNG prescaler select CK_PLLQ/10 */
#define RCU_TRNG_CKPLLQ_DIV11           CFG2_TRNGPSC(11)                             /*!< TRNG prescaler select CK_PLLQ/11 */
#define RCU_TRNG_CKPLLQ_DIV12           CFG2_TRNGPSC(12)                             /*!< TRNG prescaler select CK_PLLQ/12 */
#define RCU_TRNG_CKPLLQ_DIV13           CFG2_TRNGPSC(13)                             /*!< TRNG prescaler select CK_PLLQ/13 */
#define RCU_TRNG_CKPLLQ_DIV14           CFG2_TRNGPSC(14)                             /*!< TRNG prescaler select CK_PLLQ/14 */
#define RCU_TRNG_CKPLLQ_DIV15           CFG2_TRNGPSC(15)                             /*!< TRNG prescaler select CK_PLLQ/15 */

/* QSPI clock source selection */       
#define CFG2_QSPISEL(regval)            (BITS(16,17) & ((uint32_t)(regval) << 16U))
#define RCU_QSPISRC_CKSYS               CFG2_QSPISEL(0)                              /*!< CK_QSPI select CK_CKSYS */
#define RCU_QSPISRC_IRC8M               CFG2_QSPISEL(1)                              /*!< CK_QSPI select CK_IRC8M */
#define RCU_QSPISRC_PLLQ                CFG2_QSPISEL(2)                              /*!< CK_QSPI select PLLQ */ 
#define RCU_QSPISRC_PLLR                CFG2_QSPISEL(3)                              /*!< CK_QSPI select PLLR */

/* ADC clock source selection */
#define CFG2_ADC0_1_2SEL(regval)        (BITS(26,27) & ((uint32_t)(regval) << 26U))
#define RCU_ADCSRC_PLLR                 CFG2_ADC0_1_2SEL(1)                          /*!< CK_ADC select CK_PLLR */
#define RCU_ADCSRC_CKSYS                CFG2_ADC0_1_2SEL(2)                          /*!< CK_ADC select IRC8M */

/* HRTIMER clock source selection */
#define RCU_HRTIMERSRC_CKAPB2          ((uint32_t)0x00000000U)                       /*!< APB2 clock selected as HRTIMER source clock */
#define RCU_HRTIMERSRC_CKSYS           RCU_CFG2_HRTIMERSEL                           /*!< system clock selected as HRTIMER source clock */

/* function declarations */
/* deinitialize the RCU */
void rcu_deinit(void);
/* enable the peripherals clock */
void rcu_periph_clock_enable(rcu_periph_enum periph);
/* disable the peripherals clock */
void rcu_periph_clock_disable(rcu_periph_enum periph);
/* enable the peripherals clock when sleep mode */
void rcu_periph_clock_sleep_enable(rcu_periph_sleep_enum periph);
/* disable the peripherals clock when sleep mode */
void rcu_periph_clock_sleep_disable(rcu_periph_sleep_enum periph);
/* reset the peripherals */
void rcu_periph_reset_enable(rcu_periph_reset_enum periph_reset);
/* disable reset the peripheral */
void rcu_periph_reset_disable(rcu_periph_reset_enum periph_reset);
/* reset the BKP domain */
void rcu_bkp_reset_enable(void);
/* disable the BKP domain reset */
void rcu_bkp_reset_disable(void);

